[{"r.TechnologyMaturity": "Startup", "n.Name": "3DPrinting", "n.PopularExamples": "Media Examples", "n.DisplayName": "3D Printing", "n.WikiURL": "https://en.wikipedia.org/wiki/3D_printing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Radical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": "2010", "n.Vendors": "Enter Vendors", "n.Definition": "3D printing, also known as additive manufacturing (AM), refers to processes used to synthesize a three-dimensional object[1] in which successive layers of material are formed under computer control to create an object.[2]Objects can be of almost any shape or geometry and are produced from digital model data 3D model or another electronic data source such as an Additive Manufacturing File (AMF) file.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "AdvancedAnalytics", "n.PopularExamples": "Media Examples", "n.DisplayName": "Advanced Analytics", "n.WikiURL": "https://en.wikipedia.org/wiki/Analytics", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "Angoss; APT; FICO; IBM; RapidMiner; SAP; SAS", "n.Definition": "Analytics is the discovery, interpretation, and communication of meaningful patterns in data. Especially valuable in areas rich with recorded information, analytics relies on the simultaneous application of statistics, computer programming and operations research to quantify performance. Analytics often favors data visualization to communicate insight. Analytics is multidisciplinary. There is extensive use of mathematics and statistics, the use of descriptive techniques and predictive models to gain valuable knowledge from data?data analysis. The insights from data are used to recommend action or to guide decision making rooted in business context. Thus, analytics is not so much concerned with individual analyses or analysis steps, but with the entire methodology. There is a pronounced tendency to use the term analytics in business settings e.g. text analytics vs. the more generic text mining to emphasize this broader perspective.[citation needed]. There is an increasing use of the term advanced analytics,[citation needed] typically used to describe the technical aspects of analytics, especially in the emerging fields such as the use of machine learning techniques like neural networks to do predictive modeling.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Automation", "n.PopularExamples": "Media Examples", "n.DisplayName": "Automation", "n.WikiURL": "https://en.wikipedia.org/wiki/Automation", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2014", "n.Vendors": "Automic;IPSoft;Mana;Holmes", "n.Definition": "Automation[1] or automatic control, is the use of various control systems for operating equipment such as machinery, processes in factories, boilers and heat treating ovens, switching on telephone networks, steering and stabilization of ships, aircraft and other applications with minimal or reduced human intervention. Some processes have been completely automated.\n\nThe biggest benefit of automation is that it saves labor; however, it is also used to save energy and materials and to improve quality, accuracy and precision.", "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "AutonomousVehicles", "n.PopularExamples": "Media Examples", "n.DisplayName": "Autonomous Vehicles", "n.WikiURL": "https://en.wikipedia.org/wiki/Autonomous_car", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Small", "n.FirstRadarAppearance": "2009", "n.Vendors": "Anki; Bosch; Continental Automotive Systems; Google; Intel; Knightscope; Mobileye; Nokia; Nvidia; Ottomatika; Quanergy Systems; Valeo; ZMP", "n.Definition": "An autonomous car (driverless car,[1] self-driving car,[2] robotic car[3]) is a vehicle that is capable of sensing its environment and navigating without human input.[4]\n\nAutonomous cars can detect surroundings using a variety of techniques such as radar, lidar, GPS, odometry, and computer vision. Advanced control systems interpret sensory information to identify appropriate navigation paths, as well as obstacles and relevant signage.[5][6] Autonomous cars have control systems that are capable of analyzing sensory data to distinguish between different cars on the road, which is very useful in planning a path to the desired destination.[7\n", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "BigData", "n.PopularExamples": "Media Examples", "n.DisplayName": "Big Data", "n.WikiURL": "https://en.wikipedia.org/wiki/Big_data", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "Cloudera; DataStax; EMC; FICO (Blaze Advisor); Hortonworks; IBM; MapR Technologies; MarkLogic; MongoDB; Teradata", "n.Definition": "Big data is a term for data sets that are so large or complex that traditional data processing applications are inadequate. Challenges include analysis, capture, data curation, search, sharing, storage, transfer, visualization, querying, updating and information privacy. The term often refers simply to the use of predictive analytics, user behavior analytics, or certain other advanced data analytics methods that extract value from data, and seldom to a particular size of data set.[2] Accuracy in big data may lead to more confident decision making, and better decisions can result in greater operational efficiency, cost reduction and reduced risk.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "BimodalIT", "n.PopularExamples": "Media Examples", "n.DisplayName": "Bimodal IT", "n.WikiURL": "http://www.gartner.com/it-glossary/bimodal/", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2014", "n.Vendors": "Enter Vendors", "n.Definition": "Bimodal is the practice of managing two separate but coherent styles of work: one focused on predictability; the other on exploration. Mode 1 is optimized for areas that are more predictable and well-understood. It focuses on exploiting what is known, while renovating the legacy environment into a state that is fit for a digital world. Mode 2 is exploratory, experimenting to solve new problems and  optimized for areas of uncertainty. These initiatives often begin with a hypothesis that is tested and adapted during a process involving short iterations, potentially adopting a minimum viable product (MVP)  approach. Both modes are essential to create substantial value and drive significant organizational change, and neither is static. Marrying a more predictable evolution of products and technologies (Mode 1) with the new and innovative (Mode 2) is the essence of an enterprise bimodal capability. Both play an essential role in the digital transformation.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Blockchain", "n.PopularExamples": "Media Examples", "n.DisplayName": "Blockchain", "n.WikiURL": "https://en.wikipedia.org/wiki/Blockchain_(database)", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2009", "n.Vendors": "Hyperledger; Ripple Labs; Tembusu Systems", "n.Definition": "A blockchain[1][2][3]?originally, block chain[4][5]?is a distributed database that maintains a continuously-growing list of records secured from tampering and revision. It consists of data structure blocks that may contain data[6]:6[not in citation given] or programs[7]:@ 01:45?02:42[not in citation given]?with each block holding batches of individual transactions[6]:6, 31?41 and the results of any blockchain executables.[7]:@ 01:45?02:42[better source needed] Each block contains a timestamp and a link to a previous block.[8][6]:6", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "CloudComputing", "n.PopularExamples": "Media Examples", "n.DisplayName": "Cloud Computing", "n.WikiURL": "https://en.wikipedia.org/wiki/Cloud_computing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2016", "n.Vendors": "Amazon; Google; IBM; Microsoft; Oracle; Salesforce; SAP; Vmware", "n.Definition": "Cloud computing is a type of Internet-based computing that provides shared computer processing resources and data to computers and other devices on demand. It is a model for enabling ubiquitous, on-demand access to a shared pool of configurable computing resources (e.g., computer networks, servers, storage, applications and services),[1][2] which can be rapidly provisioned and released with minimal management effort. Cloud computing and storage solutions provide users and enterprises with various capabilities to store and process their data in third-party data centers[3] that may be located far from the user?ranging in distance from across a city to across the world. Cloud computing relies on sharing of resources to achieve coherence and economy of scale, similar to a utility (like the electricity grid) over an electricity network.", "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "CognitiveComputing", "n.PopularExamples": "Media Examples", "n.DisplayName": "Cognitive Computing", "n.WikiURL": "https://en.wikipedia.org/wiki/Cognitive_computing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2010", "n.Vendors": "Cognitive Scale; Digital Reasoning; Google; IBM; Microsoft; Saffron Technology; x.ai", "n.Definition": "Cognitive computing (CC) describes technology platforms that broadly speaking, are based on the scientific disciplines of Artificial Intelligence and Signal Processing. These platforms encompass machine learning, reasoning, natural language processing, speech and vision, human-computer interaction, dialog and narrative generation and more.[1][2]", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Crowdfunding", "n.PopularExamples": "Media Examples", "n.DisplayName": "Crowdfunding", "n.WikiURL": "https://en.wikipedia.org/wiki/Crowdfunding", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "GoFundMe; Kickstarter; peerbackers; RocketHub; SprinkleBit", "n.Definition": "Crowdfunding (a form of crowdsourcing) is the practice of funding a project or venture by raising monetary contributions from a large number of people, today often performed via Internet-mediated registries, but the concept can also be executed through mail-order subscriptions, benefit events, and other methods.[1] Crowdfunding is a form of alternative finance, which has emerged outside of the traditional financial system.[2]", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Crowdsourcing", "n.PopularExamples": "Media Examples", "n.DisplayName": "Crowdsourcing", "n.WikiURL": "https://en.wikipedia.org/wiki/Crowdsourcing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2014", "n.Vendors": "Amazon; clickworker; CrowdFlower; CrowdSource; IdeaScale; InnoCentive; Quora; topcoder", "n.Definition": "Crowdsourcing, a modern business term coined in 2005,[1] is defined by Merriam-Webster as the process of obtaining needed services, ideas, or content by soliciting contributions from a large group of people, especially an online community, rather than from employees or suppliers.[2][1] A portmanteau of crowd and outsourcing,[3][4] its more specific definitions are yet heavily debated.[5] This mode of sourcing is often used to divide work between participants,[6] and has a history of success prior to the digital age?\"offline\". By definition, crowdsourcing combines the efforts of numerous self-selected volunteers or part-time workers; each person's contribution combines with those of others to achieve a cumulative result. Crowdsourcing is distinguished from outsourcing in that the work can come from an undefined public (instead of being commissioned from a specific, named group) and in that crowdsourcing includes a mix of bottom-up and top-down processes.[7][8][9] Regarding the most significant advantages of using crowdsourcing the literature generally discussed costs, speed, quality, flexibility, scalability, and diversity.[10][11]", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "DigitalSecurity", "n.PopularExamples": "Media Examples", "n.DisplayName": "Digital Security", "n.WikiURL": "https://en.wikipedia.org/wiki/Digital_security", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2008", "n.Vendors": "Amazon; Apple; Audi; BMW; Bosch Security Systems; GE; Google; IBM; Intel; Microsoft; Samsung", "n.Definition": "Internet security involves the protection of a computer's internet account and files from intrusion by an outside user. Internet users today are very familiar with companies like Symantec (Norton Anti-Virus) and McAfee that provide them with internet security products to guard against computer viruses, as well as to provide secure firewalls and protection against spyware.\n\nOrganizations like the Center for Internet Security (CIS) provide enterprises with resources for measuring information security status and making rational security investment decisions.[1] The fact that an organization like CIS exists today is proof of the importance of maintaining adequate internet security.\n\nAnother example of secure smart card technology usage is the Microsoft .NET card framework. This is a software framework that is available with several Microsoft Windows operating systems. It includes a library of coded solutions to prevent common programming problems and a virtual machine that manages the execution of programs written specifically for the framework.\n\nDigital security combines current cybersecurity and risk practice with digital business practice to protect all digitalized assets of an organization, whether at the core of the enterprise or at its edge.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "GenomicsMedicine", "n.PopularExamples": "Media Examples", "n.DisplayName": "Genomics Medicine", "n.WikiURL": "https://en.wikipedia.org/wiki/Medical_genetics", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Heigh", "n.FirstRadarAppearance": "2009", "n.Vendors": "Ayasdi; Eurofins Genomics; GenoSpace; Hearst Health; IBM Watson Health; Illumina; Integrated BioBank of Luxembourg; NantHealth", "n.Definition": "Medical genetics is the branch of medicine that involves the diagnosis and management of hereditary disorders. Medical genetics differs from human genetics in that human genetics is a field of scientific research that may or may not apply to medicine, while medical genetics refers to the application of genetics to medical care. For example, research on the causes and inheritance of genetic disorders would be considered within both human genetics and medical genetics, while the diagnosis, management, and counselling people with genetic disorders would be considered part of medical genetics.\n\nIn contrast, the study of typically non-medical phenotypes such as the genetics of eye color would be considered part of human genetics, but not necessarily relevant to medical genetics (except in situations such as albinism). Genetic medicine is a newer term for medical genetics and incorporates areas such as gene therapy, personalized medicine, and the rapidly emerging new medical specialty, predictive medicine.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "GreenIT", "n.PopularExamples": "Media Examples", "n.DisplayName": "Green IT", "n.WikiURL": "https://en.wikipedia.org/wiki/Green_computing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Tactical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": "2016", "n.Vendors": "Enter Vendors", "n.Definition": "Green computing, Green ICT as per IFG International Federation of Green ICT and IFG Standard, green IT, or ICT sustainability, is the study and practice of environmentally sustainable computing or IT. San Murugesan notes that this can include \"designing, manufacturing, using, and disposing of computers, servers, and associated subsystems?such as monitors, printers, storage devices, and networking and communications systems ? efficiently and effectively with minimal or no effect on the environment.\"[1]", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "HumanMachineInterface", "n.PopularExamples": "Media Examples", "n.DisplayName": "Human Machine Interface", "n.WikiURL": "https://en.wikipedia.org/wiki/User_interface", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2010", "n.Vendors": "Enter Vendors", "n.Definition": "The user interface (UI), in the industrial design field of human?machine interaction, is the space where interactions between humans and machines occur. The goal of this interaction is to allow effective operation and control of the machine from the human end, whilst the machine simultaneously feeds back information that aids the operators' decision-making process. Examples of this broad concept of user interfaces include the interactive aspects of computer operating systems, hand tools, heavy machinery operator controls, and process controls. The design considerations applicable when creating user interfaces are related to or involve such disciplines as ergonomics and psychology.\n\nOther terms for user interface are man?machine interface (MMI) and when the machine in question is a computer human?computer interface.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "Industrial3DPrinting", "n.PopularExamples": "Media Examples", "n.DisplayName": "Industrial 3D Printing", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Small", "n.FirstRadarAppearance": "2008", "n.Vendors": "3D Systems; Arcam; Aspect; Concept Laser; EOS; Optomec; Renishaw; Sciaky; Stratasys; Wuhan Binhu Mechanical & Electrical", "n.Definition": "Industrial 3D printing involves the use of additive manufacturing devices to produce high-end prototypes and finished goods from a broad range of materials. These devices stretch anyone's definition of \"printer\" to the limit by the range of technologies and selling prices often exceeding $100,000.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "In-MemoryComputing", "n.PopularExamples": "Media Examples", "n.DisplayName": "In-Memory Computing", "n.WikiURL": "https://www.techopedia.com/definition/28539/in-memory-computing", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2014", "n.Vendors": "GigaSpaces Technologies; IBM; Magic Software Enterprises; Microsoft; Oracle; Pivotal; Qlik; Relex; SanDisk; SAP; Software AG; Teradata; Tibco Software; Workday", "n.Definition": "In-memory computing is the storage of information in the main random access memory (RAM) of dedicated servers rather than in complicated relational databases operating on comparatively slow disk drives. In-memory computing helps business customers, including retailers, banks and utilities, to quickly detect patterns, analyze massive data volumes on the fly, and perform their operations quickly. The drop in memory prices in the present market is a major factor contributing to the increasing popularity of in-memory computing technology. This has made in-memory computing economical among a wide variety of applications.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "InternetOfThings", "n.PopularExamples": "Media Examples", "n.DisplayName": "Internet Of Things", "n.WikiURL": "https://en.wikipedia.org/wiki/Internet_of_things", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2009", "n.Vendors": "Enter Vendors", "n.Definition": "The internet of things (IoT) is the network of physical devices, vehicles, buildings and other items?embedded with electronics, software, sensors, actuators, and network connectivity that enable these objects to collect and exchange data.[1] In 2013 the Global Standards Initiative on Internet of Things (IoT-GSI) defined the IoT as \"the infrastructure of the information society.\" [2] The IoT allows objects to be sensed and/or controlled remotely across existing network infrastructure,[3] creating opportunities for more direct integration of the physical world into computer-based systems, and resulting in improved efficiency, accuracy and economic benefit.[4][5][6][7][8][9] When IoT is augmented with sensors and actuators, the technology becomes an instance of the more general class of cyber-physical systems, which also encompasses technologies such as smart grids, smart homes, intelligent transportation and smart cities. Each thing is uniquely identifiable through its embedded computing system but is able to interoperate within the existing Internet infrastructure. Experts estimate that the IoT will consist of almost 50 billion objects by 2020.[10]", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "MobileTransformium", "n.PopularExamples": "Media Examples", "n.DisplayName": "Mobile Transformium", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "Enter Vendors", "n.Definition": "Transformium is, in essence, programmable matter. It is able to reconfigure its molecules to assume any shape or color it is instructed to, properties which allow the Transformers to pick and choose their malleable alternate modes, their bodies reconfiguring themselves into the shape and color of their chosen form. ", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Multi-enterpriseSolutions\n", "n.PopularExamples": "Media Examples", "n.DisplayName": "Multi-enterprise Solutions\n", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2014", "n.Vendors": "Alcatel-Lucent; Apigee; CA Technologies; Cisco; Huawei; Intel; Neustar; Nexmo; Oracle; Twilio", "n.Definition": "The multienterprise solution market offers an array of technologies that support further business process digitization, ecosystem integration and IoT connections.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "NextGenerationITInfrastructure", "n.PopularExamples": "Media Examples", "n.DisplayName": "Next Generation IT Infrastructure", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2009", "n.Vendors": "Enter Vendors", "n.Definition": "Next Generation Infra systems are integrated systems that apply a modular building block approach to scale compute and direct-attached storage on commodity hardware by leveraging scale-out clusters of standardized building blocks.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "OpenData", "n.PopularExamples": "Media Examples", "n.DisplayName": "Open Data", "n.WikiURL": "https://en.wikipedia.org/wiki/Open_data", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2010", "n.Vendors": "BrightPlanet; Connotate; Microsoft Azure Marketplace; Prevedere; ProgrammableWeb; Socrata", "n.Definition": "Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control.[1] The goals of the open data movement are similar to those of other \"open\" movements such as open source, open hardware, open content, and open access. The philosophy behind open data has been long established (for example in the Mertonian tradition of science), but the term \"open data\" itself is recent, gaining popularity with the rise of the Internet and World Wide Web and, especially, with the launch of open-data government initiatives such as Data.gov and Data.gov.uk", "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "PostSMACERP", "n.PopularExamples": "Media Examples", "n.DisplayName": "Post SMAC ERP", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "Enter Vendors", "n.Definition": "SMAC has been influencing everything. Its influence can be also seen in business software like ERP and CRM. Today, ERP software need to be integrated with social platforms and marketing software to give the company a holistic view of the all the departments and also be in touch with the customer.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "SharingEconomy", "n.PopularExamples": "Media Examples", "n.DisplayName": "Sharing Economy", "n.WikiURL": "https://en.wikipedia.org/wiki/Sharing_economy", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2014", "n.Vendors": "AppMuse; Juggernaut", "n.Definition": "Sharing economy is an umbrella term with a range of meanings, often used to describe economic and social activity involving online transactions. Originally growing out of the open-source community to refer to peer-to-peer based sharing of access to goods and services,[1] the term is now sometimes used in a broader sense to describe any sales transactions that are done via online market places, even ones that are business to consumer (B2C), rather than peer-to-peer. For this reason, the term sharing economy has been criticised as misleading, some arguing that even services that enable peer-to-peer exchange can be primarily profit-driven.[2] However, many commentators assert that the term is still valid as a means of describing a generally more democratized marketplace, even when it's applied to a broader spectrum of services.\n\nAlso known as shareconomy, collaborative consumption or peer economy, a common academic definition of the term refers to a hybrid market model (in between owning and gift giving) of peer-to-peer exchange. Such transactions are often facilitated via community-based online services.[1][3]", "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "SmartMachines", "n.PopularExamples": "Media Examples", "n.DisplayName": "Smart Machines", "n.WikiURL": "http://searchcio.techtarget.com/definition/smart-machines", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2009", "n.Vendors": "Enter Vendors", "n.Definition": "In general, a smart machine is an intelligent device that uses machine-to-machine (M2M) technology.Smart machines include robots, self-driving cars and other cognitive computing systems that are able to make decisions and solve problems without human intervention.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "SmartWorkspace", "n.PopularExamples": "Media Examples", "n.DisplayName": "Smart Workspace", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "AgilQuest; Condeco; Estimote; Microsoft; Oblong; Prysm", "n.Definition": "Smart workspace creates a connected physical network of \"places and things\" that actively interacts with software applications to contextualize people's experience in the digital workplace. Smart workspace leverages the growing digitalization and programmability of physical objects brought about by the Internet of Things (IoT), enabling organizations to deliver new ways of working, sharing information and collaborating to improve workforce efficiency and effectiveness. Any location where people work can become a smart workspace.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "SoftwareDefinedEverything", "n.PopularExamples": "Media Examples", "n.DisplayName": "Software Defined Everything", "n.WikiURL": "http://www.webopedia.com/TERM/S/software-defined_everything.html", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2014", "n.Vendors": "Cisco; EMC; HP; IBM; Intel; Microsoft; NetApp; Symantec; VMware", "n.Definition": "A marketing phrase that serves to group a variety of software-defined computing technologies into one overarching moniker. The umbrella of Software-Defined Everything (SDE) technologies includes, among other terms, software-defined networking (SDN), software-defined computing, software-defined data centers (SDDC), software-defined storage (SDS) and software-defined storage networks.\n\nWith Software-Defined Everything, the computing infrastructure is virtualized and delivered as a service. In a Software-Defined Everything environment, management and control of the networking, storage and/or data center infrastructure is automated by intelligent software rather than by the hardware components of the infrastructure.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "TheProgrammableEconomy", "n.PopularExamples": "Media Examples", "n.DisplayName": "The Programmable Economy", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2009", "n.Vendors": "Enter Vendors", "n.Definition": "The programmable economy is a natively \"smart\" economic system that supports and/or manages the production and consumption of goods and services, enabling diverse scenarios of exchange of value (monetary and nonmonetary). Value is exchanged between people, organizations, and, in the future, smart machines and smart entities that have \"personhood\" equivalent to today's corporations. The scale can eventually approach the global economy, although such a transformation will take decades (as did the Internet and the Web).", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Telemedicine", "n.PopularExamples": "Media Examples", "n.DisplayName": "Telemedicine", "n.WikiURL": "https://en.wikipedia.org/wiki/Telemedicine", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Tactical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": "2016", "n.Vendors": "Enter Vendors", "n.Definition": "Telemedicine is the use of telecommunication and information technology to provide clinical health care from a distance. It helps eliminate distance barriers and can improve access to medical services that would often not be consistently available in distant rural communities. It is also used to save lives in critical care and emergency situations.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Wearables", "n.PopularExamples": "Media Examples", "n.DisplayName": "Wearables", "n.WikiURL": "https://en.wikipedia.org/wiki/Wearable_technology", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2010", "n.Vendors": "Eleksen; Eurotech; Fitbit; General Dynamics; Google; Motorola; Oculus VR; Vuzix", "n.Definition": "Wearable technology, wearables, fashionable technology, wearable devices, tech togs, or fashion electronics are clothing and accessories incorporating computer and advanced electronic technologies. The designs often incorporate practical functions and features.[1]\n\nWearable devices such as activity trackers are a good example of the Internet of Things, since they are part of the network of physical objects or \"things\" embedded with electronics, software, sensors and connectivity to enable objects to exchange data with a manufacturer, operator and/or other connected devices, without requiring human intervention.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "WebScaleApplicationArchitecture", "n.PopularExamples": "Media Examples", "n.DisplayName": "Web Scale Application Architecture", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2008", "n.Vendors": "Atomikos;Azul Systems;Caucho;CloudTran;GigaSpaces Technologies;Gnubila;Typesafe", "n.Definition": "Web-scale application architecture is an advanced style of application design that applies five key tenets: parallelization of application logic; in-memory data management; partitioning; replication of data across multiple nodes; and asynchronous, event-driven communication between system and application components. This technology is adopted for applications with exceptionally demanding performance, scalability, availability, security, manageability and dependability requirements such as cloud services and global-class applications.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Virtualization", "n.PopularExamples": "Media Examples", "n.DisplayName": "Virtualization", "n.WikiURL": "https://en.wikipedia.org/wiki/Virtualization", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2014", "n.Vendors": "Cisco; Citrix; Docker; EMC; HP; IBM; Microsoft; NetApp; Oracle; Parallels; Red Hat; VMware", "n.Definition": "In computing, virtualization refers to the act of creating a virtual (rather than actual) version of something, including virtual computer hardware platforms, operating systems, storage devices, and computer network resources.\n\nVirtualization began in the 1960s, as a method of logically dividing the system resources provided by mainframe computers between different applications. Since then, the meaning of the term has broadened.[1]", "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "XaaS", "n.PopularExamples": "Media Examples", "n.DisplayName": "X aaS", "n.WikiURL": "http://searchcloudcomputing.techtarget.com/definition/XaaS-anything-as-a-service", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": "2009", "n.Vendors": "Enter Vendors", "n.Definition": "XaaS is a collective term said to stand for a number of things including \"X as a service,\" \"anything as a service\" or \"everything as a service.\" The acronym refers to an increasing number of services that are delivered over the Internet rather than provided locally or on-site. XaaS is the essence of cloud computing. The most common examples of XaaS are Software as a Service (SaaS), Infrastructure as a Service (IaaS) and Platform as a Service (PaaS). The combined use of these three is sometimes referred to as the SPI model (SaaS, PaaS, IaaS). Other examples of XaaS include storage as a service (SaaS), communications as a service (CaaS), network as a service (NaaS) and monitoring as a service (MaaS).", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "DigitalBanking", "n.PopularExamples": "Media Examples", "n.DisplayName": "Digital Banking", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2014", "n.Vendors": "Enter Vendors", "n.Definition": "Bank CIOs and digital leaders must embrace the opportunities and threats\npresented by digital transformation, thinking strategically and acting\ntactically to ensure that they position their institutions to address their\ncustomers' changing needs.", "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "OpenBanking", "n.PopularExamples": "Media Examples", "n.DisplayName": "Open Banking", "n.WikiURL": "Description", "n.TrendType": null, "m": {"DisplayName": "Banking", "IndustryVerticalType": "Industry", "Name": "Banking", "id": "10"}, "n.CognizantCaseStudies": "Internal Case Studies", "n.Tools": "Enter Tools", "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": "2013", "n.Vendors": "Enter Vendors", "n.Definition": "Open banking uses Web APIs, apps and app stores to enable internal and/or external ecosystems to create new user interfaces (such as mobile apps), channel applications (like online banking), extend accessibility to functions, data and products, and create new digital banking solutions.", "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Wearables", "Vendors": "Eleksen; Eurotech; Fitbit; General Dynamics; Google; Motorola; Oculus VR; Vuzix", "Name": "Wearables", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "33", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Wearable_technology", "Definition": "Wearable technology, wearables, fashionable technology, wearable devices, tech togs, or fashion electronics are clothing and accessories incorporating computer and advanced electronic technologies. The designs often incorporate practical functions and features.[1]\n\nWearable devices such as activity trackers are a good example of the Internet of Things, since they are part of the network of physical objects or \"things\" embedded with electronics, software, sensors and connectivity to enable objects to exchange data with a manufacturer, operator and/or other connected devices, without requiring human intervention.", "FirstRadarAppearance": "2010"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Web Scale Application Architecture", "Vendors": "Atomikos;Azul Systems;Caucho;CloudTran;GigaSpaces Technologies;Gnubila;Typesafe", "Name": "WebScaleApplicationArchitecture", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "34", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Web-scale application architecture is an advanced style of application design that applies five key tenets: parallelization of application logic; in-memory data management; partitioning; replication of data across multiple nodes; and asynchronous, event-driven communication between system and application components. This technology is adopted for applications with exceptionally demanding performance, scalability, availability, security, manageability and dependability requirements such as cloud services and global-class applications.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "X aaS", "Vendors": "Enter Vendors", "Name": "XaaS", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "36", "Tools": "Enter Tools", "WikiURL": "http://searchcloudcomputing.techtarget.com/definition/XaaS-anything-as-a-service", "Definition": "XaaS is a collective term said to stand for a number of things including \"X as a service,\" \"anything as a service\" or \"everything as a service.\" The acronym refers to an increasing number of services that are delivered over the Internet rather than provided locally or on-site. XaaS is the essence of cloud computing. The most common examples of XaaS are Software as a Service (SaaS), Infrastructure as a Service (IaaS) and Platform as a Service (PaaS). The combined use of these three is sometimes referred to as the SPI model (SaaS, PaaS, IaaS). Other examples of XaaS include storage as a service (SaaS), communications as a service (CaaS), network as a service (NaaS) and monitoring as a service (MaaS).", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Software Defined Everything", "Vendors": "Cisco; EMC; HP; IBM; Intel; Microsoft; NetApp; Symantec; VMware", "Name": "SoftwareDefinedEverything", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "30", "Tools": "Enter Tools", "WikiURL": "http://www.webopedia.com/TERM/S/software-defined_everything.html", "Definition": "A marketing phrase that serves to group a variety of software-defined computing technologies into one overarching moniker. The umbrella of Software-Defined Everything (SDE) technologies includes, among other terms, software-defined networking (SDN), software-defined computing, software-defined data centers (SDDC), software-defined storage (SDS) and software-defined storage networks.\n\nWith Software-Defined Everything, the computing infrastructure is virtualized and delivered as a service. In a Software-Defined Everything environment, management and control of the networking, storage and/or data center infrastructure is automated by intelligent software rather than by the hardware components of the infrastructure.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Telemedicine", "Vendors": "Enter Vendors", "Name": "Telemedicine", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "32", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Telemedicine", "Definition": "Telemedicine is the use of telecommunication and information technology to provide clinical health care from a distance. It helps eliminate distance barriers and can improve access to medical services that would often not be consistently available in distant rural communities. It is also used to save lives in critical care and emergency situations.", "FirstRadarAppearance": "2016"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Tactical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "The Programmable Economy", "Vendors": "Enter Vendors", "Name": "TheProgrammableEconomy", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "31", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "The programmable economy is a natively \"smart\" economic system that supports and/or manages the production and consumption of goods and services, enabling diverse scenarios of exchange of value (monetary and nonmonetary). Value is exchanged between people, organizations, and, in the future, smart machines and smart entities that have \"personhood\" equivalent to today's corporations. The scale can eventually approach the global economy, although such a transformation will take decades (as did the Internet and the Web).", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Virtualization", "Vendors": "Cisco; Citrix; Docker; EMC; HP; IBM; Microsoft; NetApp; Oracle; Parallels; Red Hat; VMware", "Name": "Virtualization", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "35", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Virtualization", "Definition": "In computing, virtualization refers to the act of creating a virtual (rather than actual) version of something, including virtual computer hardware platforms, operating systems, storage devices, and computer network resources.\n\nVirtualization began in the 1960s, as a method of logically dividing the system resources provided by mainframe computers between different applications. Since then, the meaning of the term has broadened.[1]", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Post SMAC ERP", "Vendors": "Enter Vendors", "Name": "PostSMACERP", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "26", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "SMAC has been influencing everything. Its influence can be also seen in business software like ERP and CRM. Today, ERP software need to be integrated with social platforms and marketing software to give the company a holistic view of the all the departments and also be in touch with the customer.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Sharing Economy", "Vendors": "AppMuse; Juggernaut", "Name": "SharingEconomy", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "27", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Sharing_economy", "Definition": "Sharing economy is an umbrella term with a range of meanings, often used to describe economic and social activity involving online transactions. Originally growing out of the open-source community to refer to peer-to-peer based sharing of access to goods and services,[1] the term is now sometimes used in a broader sense to describe any sales transactions that are done via online market places, even ones that are business to consumer (B2C), rather than peer-to-peer. For this reason, the term sharing economy has been criticised as misleading, some arguing that even services that enable peer-to-peer exchange can be primarily profit-driven.[2] However, many commentators assert that the term is still valid as a means of describing a generally more democratized marketplace, even when it's applied to a broader spectrum of services.\n\nAlso known as shareconomy, collaborative consumption or peer economy, a common academic definition of the term refers to a hybrid market model (in between owning and gift giving) of peer-to-peer exchange. Such transactions are often facilitated via community-based online services.[1][3]", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Smart Machines", "Vendors": "Enter Vendors", "Name": "SmartMachines", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "28", "Tools": "Enter Tools", "WikiURL": "http://searchcio.techtarget.com/definition/smart-machines", "Definition": "In general, a smart machine is an intelligent device that uses machine-to-machine (M2M) technology.Smart machines include robots, self-driving cars and other cognitive computing systems that are able to make decisions and solve problems without human intervention.", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Smart Workspace", "Vendors": "AgilQuest; Condeco; Estimote; Microsoft; Oblong; Prysm", "Name": "SmartWorkspace", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "29", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Smart workspace creates a connected physical network of \"places and things\" that actively interacts with software applications to contextualize people's experience in the digital workplace. Smart workspace leverages the growing digitalization and programmability of physical objects brought about by the Internet of Things (IoT), enabling organizations to deliver new ways of working, sharing information and collaborating to improve workforce efficiency and effectiveness. Any location where people work can become a smart workspace.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Multi-enterprise Solutions\n", "Vendors": "Alcatel-Lucent; Apigee; CA Technologies; Cisco; Huawei; Intel; Neustar; Nexmo; Oracle; Twilio", "Name": "Multi-enterpriseSolutions\n", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "22", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "The multienterprise solution market offers an array of technologies that support further business process digitization, ecosystem integration and IoT connections.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Next Generation IT Infrastructure", "Vendors": "Enter Vendors", "Name": "NextGenerationITInfrastructure", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "23", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Next Generation Infra systems are integrated systems that apply a modular building block approach to scale compute and direct-attached storage on commodity hardware by leveraging scale-out clusters of standardized building blocks.", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Open Banking", "Vendors": "Enter Vendors", "Name": "OpenBanking", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "66", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Open banking uses Web APIs, apps and app stores to enable internal and/or external ecosystems to create new user interfaces (such as mobile apps), channel applications (like online banking), extend accessibility to functions, data and products, and create new digital banking solutions.", "FirstRadarAppearance": "2013"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Open Data", "Vendors": "BrightPlanet; Connotate; Microsoft Azure Marketplace; Prevedere; ProgrammableWeb; Socrata", "Name": "OpenData", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "25", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Open_data", "Definition": "Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control.[1] The goals of the open data movement are similar to those of other \"open\" movements such as open source, open hardware, open content, and open access. The philosophy behind open data has been long established (for example in the Mertonian tradition of science), but the term \"open data\" itself is recent, gaining popularity with the rise of the Internet and World Wide Web and, especially, with the launch of open-data government initiatives such as Data.gov and Data.gov.uk", "FirstRadarAppearance": "2010"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "In-Memory Computing", "Vendors": "GigaSpaces Technologies; IBM; Magic Software Enterprises; Microsoft; Oracle; Pivotal; Qlik; Relex; SanDisk; SAP; Software AG; Teradata; Tibco Software; Workday", "Name": "In-MemoryComputing", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "19", "Tools": "Enter Tools", "WikiURL": "https://www.techopedia.com/definition/28539/in-memory-computing", "Definition": "In-memory computing is the storage of information in the main random access memory (RAM) of dedicated servers rather than in complicated relational databases operating on comparatively slow disk drives. In-memory computing helps business customers, including retailers, banks and utilities, to quickly detect patterns, analyze massive data volumes on the fly, and perform their operations quickly. The drop in memory prices in the present market is a major factor contributing to the increasing popularity of in-memory computing technology. This has made in-memory computing economical among a wide variety of applications.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Industrial 3D Printing", "Vendors": "3D Systems; Arcam; Aspect; Concept Laser; EOS; Optomec; Renishaw; Sciaky; Stratasys; Wuhan Binhu Mechanical & Electrical", "Name": "Industrial3DPrinting", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "18", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Industrial 3D printing involves the use of additive manufacturing devices to produce high-end prototypes and finished goods from a broad range of materials. These devices stretch anyone's definition of \"printer\" to the limit by the range of technologies and selling prices often exceeding $100,000.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Mobile Transformium", "Vendors": "Enter Vendors", "Name": "MobileTransformium", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "21", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Transformium is, in essence, programmable matter. It is able to reconfigure its molecules to assume any shape or color it is instructed to, properties which allow the Transformers to pick and choose their malleable alternate modes, their bodies reconfiguring themselves into the shape and color of their chosen form. ", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Internet Of Things", "Vendors": "Enter Vendors", "Name": "InternetOfThings", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "20", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Internet_of_things", "Definition": "The internet of things (IoT) is the network of physical devices, vehicles, buildings and other items?embedded with electronics, software, sensors, actuators, and network connectivity that enable these objects to collect and exchange data.[1] In 2013 the Global Standards Initiative on Internet of Things (IoT-GSI) defined the IoT as \"the infrastructure of the information society.\" [2] The IoT allows objects to be sensed and/or controlled remotely across existing network infrastructure,[3] creating opportunities for more direct integration of the physical world into computer-based systems, and resulting in improved efficiency, accuracy and economic benefit.[4][5][6][7][8][9] When IoT is augmented with sensors and actuators, the technology becomes an instance of the more general class of cyber-physical systems, which also encompasses technologies such as smart grids, smart homes, intelligent transportation and smart cities. Each thing is uniquely identifiable through its embedded computing system but is able to interoperate within the existing Internet infrastructure. Experts estimate that the IoT will consist of almost 50 billion objects by 2020.[10]", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Genomics Medicine", "Vendors": "Ayasdi; Eurofins Genomics; GenoSpace; Hearst Health; IBM Watson Health; Illumina; Integrated BioBank of Luxembourg; NantHealth", "Name": "GenomicsMedicine", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "15", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Medical_genetics", "Definition": "Medical genetics is the branch of medicine that involves the diagnosis and management of hereditary disorders. Medical genetics differs from human genetics in that human genetics is a field of scientific research that may or may not apply to medicine, while medical genetics refers to the application of genetics to medical care. For example, research on the causes and inheritance of genetic disorders would be considered within both human genetics and medical genetics, while the diagnosis, management, and counselling people with genetic disorders would be considered part of medical genetics.\n\nIn contrast, the study of typically non-medical phenotypes such as the genetics of eye color would be considered part of human genetics, but not necessarily relevant to medical genetics (except in situations such as albinism). Genetic medicine is a newer term for medical genetics and incorporates areas such as gene therapy, personalized medicine, and the rapidly emerging new medical specialty, predictive medicine.", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Digital Security", "Vendors": "Amazon; Apple; Audi; BMW; Bosch Security Systems; GE; Google; IBM; Intel; Microsoft; Samsung", "Name": "DigitalSecurity", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "13", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Digital_security", "Definition": "Internet security involves the protection of a computer's internet account and files from intrusion by an outside user. Internet users today are very familiar with companies like Symantec (Norton Anti-Virus) and McAfee that provide them with internet security products to guard against computer viruses, as well as to provide secure firewalls and protection against spyware.\n\nOrganizations like the Center for Internet Security (CIS) provide enterprises with resources for measuring information security status and making rational security investment decisions.[1] The fact that an organization like CIS exists today is proof of the importance of maintaining adequate internet security.\n\nAnother example of secure smart card technology usage is the Microsoft .NET card framework. This is a software framework that is available with several Microsoft Windows operating systems. It includes a library of coded solutions to prevent common programming problems and a virtual machine that manages the execution of programs written specifically for the framework.\n\nDigital security combines current cybersecurity and risk practice with digital business practice to protect all digitalized assets of an organization, whether at the core of the enterprise or at its edge.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Human Machine Interface", "Vendors": "Enter Vendors", "Name": "HumanMachineInterface", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "17", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/User_interface", "Definition": "The user interface (UI), in the industrial design field of human?machine interaction, is the space where interactions between humans and machines occur. The goal of this interaction is to allow effective operation and control of the machine from the human end, whilst the machine simultaneously feeds back information that aids the operators' decision-making process. Examples of this broad concept of user interfaces include the interactive aspects of computer operating systems, hand tools, heavy machinery operator controls, and process controls. The design considerations applicable when creating user interfaces are related to or involve such disciplines as ergonomics and psychology.\n\nOther terms for user interface are man?machine interface (MMI) and when the machine in question is a computer human?computer interface.", "FirstRadarAppearance": "2010"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Green IT", "Vendors": "Enter Vendors", "Name": "GreenIT", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "16", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Green_computing", "Definition": "Green computing, Green ICT as per IFG International Federation of Green ICT and IFG Standard, green IT, or ICT sustainability, is the study and practice of environmentally sustainable computing or IT. San Murugesan notes that this can include \"designing, manufacturing, using, and disposing of computers, servers, and associated subsystems?such as monitors, printers, storage devices, and networking and communications systems ? efficiently and effectively with minimal or no effect on the environment.\"[1]", "FirstRadarAppearance": "2016"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Tactical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Crowdfunding", "Vendors": "GoFundMe; Kickstarter; peerbackers; RocketHub; SprinkleBit", "Name": "Crowdfunding", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "10", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Crowdfunding", "Definition": "Crowdfunding (a form of crowdsourcing) is the practice of funding a project or venture by raising monetary contributions from a large number of people, today often performed via Internet-mediated registries, but the concept can also be executed through mail-order subscriptions, benefit events, and other methods.[1] Crowdfunding is a form of alternative finance, which has emerged outside of the traditional financial system.[2]", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Cognitive Computing", "Vendors": "Cognitive Scale; Digital Reasoning; Google; IBM; Microsoft; Saffron Technology; x.ai", "Name": "CognitiveComputing", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "9", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Cognitive_computing", "Definition": "Cognitive computing (CC) describes technology platforms that broadly speaking, are based on the scientific disciplines of Artificial Intelligence and Signal Processing. These platforms encompass machine learning, reasoning, natural language processing, speech and vision, human-computer interaction, dialog and narrative generation and more.[1][2]", "FirstRadarAppearance": "2010"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Digital Banking", "Vendors": "Enter Vendors", "Name": "DigitalBanking", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "65", "Tools": "Enter Tools", "WikiURL": "Description", "Definition": "Bank CIOs and digital leaders must embrace the opportunities and threats\npresented by digital transformation, thinking strategically and acting\ntactically to ensure that they position their institutions to address their\ncustomers' changing needs.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Crowdsourcing", "Vendors": "Amazon; clickworker; CrowdFlower; CrowdSource; IdeaScale; InnoCentive; Quora; topcoder", "Name": "Crowdsourcing", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "11", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Crowdsourcing", "Definition": "Crowdsourcing, a modern business term coined in 2005,[1] is defined by Merriam-Webster as the process of obtaining needed services, ideas, or content by soliciting contributions from a large group of people, especially an online community, rather than from employees or suppliers.[2][1] A portmanteau of crowd and outsourcing,[3][4] its more specific definitions are yet heavily debated.[5] This mode of sourcing is often used to divide work between participants,[6] and has a history of success prior to the digital age?\"offline\". By definition, crowdsourcing combines the efforts of numerous self-selected volunteers or part-time workers; each person's contribution combines with those of others to achieve a cumulative result. Crowdsourcing is distinguished from outsourcing in that the work can come from an undefined public (instead of being commissioned from a specific, named group) and in that crowdsourcing includes a mix of bottom-up and top-down processes.[7][8][9] Regarding the most significant advantages of using crowdsourcing the literature generally discussed costs, speed, quality, flexibility, scalability, and diversity.[10][11]", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Academic", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Bimodal IT", "Vendors": "Enter Vendors", "Name": "BimodalIT", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "6", "Tools": "Enter Tools", "WikiURL": "http://www.gartner.com/it-glossary/bimodal/", "Definition": "Bimodal is the practice of managing two separate but coherent styles of work: one focused on predictability; the other on exploration. Mode 1 is optimized for areas that are more predictable and well-understood. It focuses on exploiting what is known, while renovating the legacy environment into a state that is fit for a digital world. Mode 2 is exploratory, experimenting to solve new problems and  optimized for areas of uncertainty. These initiatives often begin with a hypothesis that is tested and adapted during a process involving short iterations, potentially adopting a minimum viable product (MVP)  approach. Both modes are essential to create substantial value and drive significant organizational change, and neither is static. Marrying a more predictable evolution of products and technologies (Mode 1) with the new and innovative (Mode 2) is the essence of an enterprise bimodal capability. Both play an essential role in the digital transformation.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Big Data", "Vendors": "Cloudera; DataStax; EMC; FICO (Blaze Advisor); Hortonworks; IBM; MapR Technologies; MarkLogic; MongoDB; Teradata", "Name": "BigData", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "5", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Big_data", "Definition": "Big data is a term for data sets that are so large or complex that traditional data processing applications are inadequate. Challenges include analysis, capture, data curation, search, sharing, storage, transfer, visualization, querying, updating and information privacy. The term often refers simply to the use of predictive analytics, user behavior analytics, or certain other advanced data analytics methods that extract value from data, and seldom to a particular size of data set.[2] Accuracy in big data may lead to more confident decision making, and better decisions can result in greater operational efficiency, cost reduction and reduced risk.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Cloud Computing", "Vendors": "Amazon; Google; IBM; Microsoft; Oracle; Salesforce; SAP; Vmware", "Name": "CloudComputing", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "8", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Cloud_computing", "Definition": "Cloud computing is a type of Internet-based computing that provides shared computer processing resources and data to computers and other devices on demand. It is a model for enabling ubiquitous, on-demand access to a shared pool of configurable computing resources (e.g., computer networks, servers, storage, applications and services),[1][2] which can be rapidly provisioned and released with minimal management effort. Cloud computing and storage solutions provide users and enterprises with various capabilities to store and process their data in third-party data centers[3] that may be located far from the user?ranging in distance from across a city to across the world. Cloud computing relies on sharing of resources to achieve coherence and economy of scale, similar to a utility (like the electricity grid) over an electricity network.", "FirstRadarAppearance": "2016"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Blockchain", "Vendors": "Hyperledger; Ripple Labs; Tembusu Systems", "Name": "Blockchain", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "7", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Blockchain_(database)", "Definition": "A blockchain[1][2][3]?originally, block chain[4][5]?is a distributed database that maintains a continuously-growing list of records secured from tampering and revision. It consists of data structure blocks that may contain data[6]:6[not in citation given] or programs[7]:@ 01:45?02:42[not in citation given]?with each block holding batches of individual transactions[6]:6, 31?41 and the results of any blockchain executables.[7]:@ 01:45?02:42[better source needed] Each block contains a timestamp and a link to a previous block.[8][6]:6", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Industrialized", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Automation", "Vendors": "Automic;IPSoft;Mana;Holmes", "Name": "Automation", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "3", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Automation", "Definition": "Automation[1] or automatic control, is the use of various control systems for operating equipment such as machinery, processes in factories, boilers and heat treating ovens, switching on telephone networks, steering and stabilization of ships, aircraft and other applications with minimal or reduced human intervention. Some processes have been completely automated.\n\nThe biggest benefit of automation is that it saves labor; however, it is also used to save energy and materials and to improve quality, accuracy and precision.", "FirstRadarAppearance": "2014"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Adopt", "r.BusinessImpact": "Radical", "r.MarketPotential": "High", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Early Mainstream", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Autonomous Vehicles", "Vendors": "Anki; Bosch; Continental Automotive Systems; Google; Intel; Knightscope; Mobileye; Nokia; Nvidia; Ottomatika; Quanergy Systems; Valeo; ZMP", "Name": "AutonomousVehicles", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "4", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Autonomous_car", "Definition": "An autonomous car (driverless car,[1] self-driving car,[2] robotic car[3]) is a vehicle that is capable of sensing its environment and navigating without human input.[4]\n\nAutonomous cars can detect surroundings using a variety of techniques such as radar, lidar, GPS, odometry, and computer vision. Advanced control systems interpret sensory information to identify appropriate navigation paths, as well as obstacles and relevant signage.[5][6] Autonomous cars have control systems that are capable of analyzing sensory data to distinguish between different cars on the road, which is very useful in planning a path to the desired destination.[7\n", "FirstRadarAppearance": "2009"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Disruptive", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Emerging", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "3D Printing", "Vendors": "Enter Vendors", "Name": "3DPrinting", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "1", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/3D_printing", "Definition": "3D printing, also known as additive manufacturing (AM), refers to processes used to synthesize a three-dimensional object[1] in which successive layers of material are formed under computer control to create an object.[2]Objects can be of almost any shape or geometry and are produced from digital model data 3D model or another electronic data source such as an Additive Manufacturing File (AMF) file.", "FirstRadarAppearance": "2010"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Trial/Watch", "r.BusinessImpact": "Radical", "r.MarketPotential": "Small", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}, {"r.TechnologyMaturity": "Startup", "n.Name": "Banking", "n.PopularExamples": null, "n.DisplayName": "Banking", "n.WikiURL": null, "n.TrendType": null, "m": {"DisplayName": "Advanced Analytics", "Vendors": "Angoss; APT; FICO; IBM; RapidMiner; SAP; SAS", "Name": "AdvancedAnalytics", "PopularExamples": "Media Examples", "CognizantCaseStudies": "Internal Case Studies", "id": "2", "Tools": "Enter Tools", "WikiURL": "https://en.wikipedia.org/wiki/Analytics", "Definition": "Analytics is the discovery, interpretation, and communication of meaningful patterns in data. Especially valuable in areas rich with recorded information, analytics relies on the simultaneous application of statistics, computer programming and operations research to quantify performance. Analytics often favors data visualization to communicate insight. Analytics is multidisciplinary. There is extensive use of mathematics and statistics, the use of descriptive techniques and predictive models to gain valuable knowledge from data?data analysis. The insights from data are used to recommend action or to guide decision making rooted in business context. Thus, analytics is not so much concerned with individual analyses or analysis steps, but with the entire methodology. There is a pronounced tendency to use the term analytics in business settings e.g. text analytics vs. the more generic text mining to emphasize this broader perspective.[citation needed]. There is an increasing use of the term advanced analytics,[citation needed] typically used to describe the technical aspects of analytics, especially in the emerging fields such as the use of machine learning techniques like neural networks to do predictive modeling.", "FirstRadarAppearance": "2008"}, "n.CognizantCaseStudies": null, "n.Tools": null, "r.HypeLevel": "Pilot", "r.BusinessImpact": "Radical", "r.MarketPotential": "Medium", "n.FirstRadarAppearance": null, "n.Vendors": null, "n.Definition": null, "r.AdoptionLevel": "Adolescent", "r.IndustryVertical": "Banking"}]